<?php
  include_once 'header.php';
?>
<pre style="font-size: 15px;">
  ΠΛΗΡΟΦΟΡΙΚΗ

  Η πληροφορική είναι η επιστήμη που ερευνά την κωδικοποίηση, διαχείριση και μετάδοση συμβολικών αναπαραστάσεων
  πληροφοριών. Εξετάζει τη σχεδίαση, υλοποίηση και βελτιστοποίηση αυτοματοποιημένων διατάξεων, συσκευών συστημάτων
  συλλογής, αποθήκευσης, επεξεργασίας και ανταλλαγής των αναπαραστάσεων. Ως επιστημονικό πεδίο, η πληροφορική περί-
  που ταυτίζεται με την επιστήμη υπολογιστών.

  Η αυτοματοποιημένη υλοποίηση των μεθόδων της πληροφορικής βασίστηκε από την πρώτη στιγμή στους ηλεκτρονικούς υπο-
  λογιστές. Ωστόσο έχει έναν ευρύτερο σκοπό που δεν περιορίζεται σε συγκεκριμένες τεχνολογικές επιλογές. Για παρά-
  δειγμα, ο αλγόριθμος της δυαδικής αναζήτησης μπορεί να εφαρμοστεί και σε τηλεφωνικό κατάλογο χειρωνακτικά, ενώ ένα
  πρωτόκολλο επικοινωνίας μπορεί να εφαρμοστεί ακόμη και σε σήματα καπνού. Η πληροφορική επομένως, αναλόγως με το
  επίπεδο αφαίρεσης, μπορεί να μελετηθεί είτε ανεξάρτητα από τις τεχνολογικές της συνιστώσες, είτε ως ένα ενιαίο με
  αυτές επιστημονικό πεδίο.

  Η ιστορία της πληροφορικής ξεκινά με ποικίλες προσπάθειες κατασκευής υπολογιστικών μηχανών με στόχο την αυτοματο-
  ποίηση αριθμητικών υπολογισμών, πολύ πριν από την ανάπτυξη των σύγχρονων ψυφιακών υπολογιστών. Η επιστήμη υπολογι-
  στών εμφανίστηκε ως πεδίο των διακριτών μαθηματικών κατά τη δεκαετία του 1930. Στη συνέχεια, ο ENIAC (1946) υπήρξε
  ο πρώτος αναπρογραμματιζόμενος ηλεκτρονικός υπολογιστής γενικού σκοπού.

  Σήμερα η πληροφορική ασχολείται με ένα ευρύ φάσμα θεμάτων, όπως η ανάπτυξη αλγορίθμων για την αποτελεσματική επίλυση
  προβλημάτων, η κατασκευή και βελτίωση συστημάτων λογισμικού και υλικού υψηλής απόδοσης, η ταχεία και ασφαλής διακί-
  νηση πληροφοριών μέσω τηλεπικοινωνιακων δικτύων, η δημιουργία συστημάτων διαχείρισης δεδομένων, η διερεύνηση του τρό-
  που με τον οποίο ο άνθρωπος διατυπώνει συλλογισμούς, η προσομοίωση της λειτουργίας του ανθρώπινου εγκεφάλου κλπ. Έτσι,
  η πληροφορική συνδέεται άμεσα με όλες τις θετικές επιστήμες, αλλά και με πολλές άλλες όπως η φιλοσοφία, η ψυχολογία,
  η γλωσσολογίας, η νομική, η ιατρική, τα οικονομικά και η διοίκηση επιχειρήσεων.
</pre>
<?php
  include_once 'footer.php';
?>
